app/views/tenants/edit.html.erb

SELECT "payments".* FROM "payments" WHERE "payments"."tenant_id" = ? LIMIT ?  [["tenant_id", 1], ["LIMIT", 1]]
---

    <% if @tenant.payment.blank? %>