app/helpers/application_helper.rb

SELECT "payments".* FROM "payments" WHERE "payments"."tenant_id" = ? LIMIT ?  [["tenant_id", 1], ["LIMIT", 1]]
---
    def class_name_for_tenant_form(tenant)
        return "cc_form" if tenant.payment.blank?