app/controllers/application_controller.rb

SELECT "tenants".* FROM "tenants" INNER JOIN "tenants_users" ON "tenants"."id" = "tenants_users"."tenant_id" WHERE "tenants_users"."user_id" = ? ORDER BY "tenants"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
    def current_tenant
        @current_tenant ||= current_user.tenants.first