app/controllers/members_controller.rb

    def create()
      @user   = User.new( user_params )
      @member = Member.new(member_params)
      @member.user = @user
      @user.tenants << current_tenant
      @member.tenant = current_tenant

      # ok to create user, member
      if @user.save_and_invite_member() && @member.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at", "is_admin", "skip_confirm_change_password") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "members" ("tenant_id", "user_id", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["tenant_id", 1], ["user_id", 2], ["first_name", "chiku"], ["last_name", "borah"], ["created_at", "2023-07-18 06:31:20.629043"], ["updated_at", "2023-07-18 06:31:20.629043"]]