app/controllers/projects_controller.rb

    def set_tenant
      @tenant = Tenant.find(params[:tenant_id])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]