app/controllers/registrations_controller.rb

INSERT INTO "tenants" ("name", "plan", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "zxc"], ["plan", "free"], ["created_at", "2023-07-18 06:29:40.646235"], ["updated_at", "2023-07-18 06:29:40.646235"]]
---
	def create
		# have a working copy of the params in case Tenant callbacks
		# make any changes
		tenant_params = sign_up_params_tenant
		user_params   = sign_up_params_user.merge({ is_admin: true })
		#   coupon_params = sign_up_params_coupon
		coupon_params = nil

		sign_out_session!
		# next two lines prep signup view parameters
		prep_signup_view( tenant_params, user_params, coupon_params )

		# validate recaptcha first unless not enabled
		# if !::Devise.use_recaptcha  ||  verify_recaptcha

          Tenant.transaction  do
              @tenant = Tenant.create(tenant_params)