app/controllers/tenants_controller.rb

    def update
        respond_to do |format|
            Tenant.transaction do
                if @tenant.update(tenant_params)
                    if @tenant.plan == 'premium' && @tenant.payment.blank?
                        @payment = Payment.new({ email: tenant_params['email'], token: params[:payment]['token'], tenant: @tenant})
                        begin
                            @payment.process_payment
                            @payment.save
                        rescue => exception
                            flash[:error] = exception.message
                            @payment.destroy
                            @tenant.plan = 'free'
                            @tenant.save
---
UPDATE "tenants" SET "plan" = ?, "updated_at" = ? WHERE "tenants"."id" = ?  [["plan", "premium"], ["updated_at", "2023-07-19 09:34:35.579782"], ["id", 3]]
SELECT "payments".* FROM "payments" WHERE "payments"."tenant_id" = ? LIMIT ?  [["tenant_id", 3], ["LIMIT", 1]]
UPDATE "tenants" SET "plan" = ?, "updated_at" = ? WHERE "tenants"."id" = ?  [["plan", "free"], ["updated_at", "2023-07-19 09:34:35.601892"], ["id", 3]]

    def set_tenant
        @tenant = Tenant.find(current_tenant.id)
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]