app/models/project.rb

SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def self.by_user_plan_and_tenant(tenant_id, user)
    tenant = Tenant.find(tenant_id)