app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(email) = 'chikuborah12345@gmail.com')
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "confirmation_token", "confirmed_at", "confirmation_sent_at", "unconfirmed_email", "created_at", "updated_at", "is_admin", "skip_confirm_change_password") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chikuborah12345@gmail.com"], ["LIMIT", 1]]
---
    def save_and_invite_member
        status = nil
        if (self.email.blank?)
            self.errors.add(:email, :blank)
        elsif User.where([ "lower(email) = ?", self.email.downcase ]).present?
            self.errors.add(:email, :taken)
        else
            if self.password.blank?
                self.password = "password"
                self.password_confirmation = self.password
            else
                # if a password is being supplied, then ok to skip
                # setting up a password upon confirm
                self.skip_confirm_change_password = true #if ::Milia.use_invite_member
            end
            status = self.save && self.errors.empty?